import React from 'react';

function TermsOfService() 
{
    return (
        <div className="container">
            <div className="row">
                <div className="col-lg-8 offset-lg-2">
                    <h2 className="text-center mt-5">شروط الخدمة</h2>
                    <p>مرحبًا بك في موقعنا التعليمي الجامعي EduSpark . باستخدام هذا الموقع، فإنك توافق على الامتثال للشروط والأحكام التالية:</p>

                  
                    <h3>مُلخصات ودورات</h3>
                    <p>يقدم موقعنا ملخصات ودورات للبيع. هذه المواد التعليمية متوفرة لأغراض إعلامية ولا تعد بديلاً عن حضور الدورات الفعلية. نحن لا نضمن دقة أو اكتمال الملخصات والدورات المتاحة على موقعنا.</p>

                    <h3>التسجيل</h3>
                    <p>من أجل الوصول إلى ميزات معينة والتسجيل في الدورات، قد يُطلب منك إنشاء حساب وتقديم معلومات شخصية. أنت مسؤول عن الحفاظ على سرية حسابك وكلمة المرور الخاصة بك وتقييد الوصول إلى جهاز الكمبيوتر الخاص بك أو الجهاز الذي تستخدمه.</p>

                    <h3>الملكية الفكرية</h3>
                    <p>جميع حقوق الملكية الفكرية في الملخصات والدورات المتاحة على موقعنا مملوكة للمدرسين أو مبتكري المحتوى المعنيين. لا يجوز لك استنساخ أو توزيع أو إنشاء أعمال مشتقة من المواد دون الحصول على إذن مسبق.</p>

                    <h3>إخلاء المسؤولية</h3>
                    <p>على الرغم من أننا نسعى لتوفير معلومات دقيقة ومحدثة، إلا أننا لا نقدم أي ضمانات أو تمثيلات بأي نوع، صريحة أو ضمنية، بشأن اكتمال أو دقة أو موثوقية أو مناسبة أو توافر المعلومات أو المنتجات أو الخدمات أو الرسومات ذات الصلة على موقعنا.</p>

                    <h3>تحديد المسؤولية</h3>
                    <p>نحن غير مسؤولين عن أي أضرار مباشرة أو غير مباشرة أو عرضية أو خاصة أو عقابية تنشأ عن استخدامك لموقعنا أو عدم القدرة على استخدام المواد المقدمة، حتى لو تم تنبيهنا بإمكانية حدوث مثل هذه الأضرار.</p>

                    <h3>تغييرات على شروط الخدمة</h3>
                    <p>نحتفظ بالحق في تعديل أو استبدال هذه الشروط والأحكام في أي وقت. استخدامك المستمر للموقع بعد أي تغيير يشكل قبولًا للشروط المعدلة.</p>

                    <h3>تواصل معنا</h3>
                    <p>إذا كان لديك أي أسئلة أو استفسارات حول شروط الخدمة هذه، يرجى التواصل معنا عبر المعلومات الاتصال المقدمة.</p>
                </div>
            </div>
        </div>
    );
}

export default TermsOfService;
